app/controllers/lanparties_controller.rb

SELECT * FROM "lanparties" WHERE (DATETIME() > end) ORDER BY start DESC
---
  def index
    @lanparties = Lanparty.find(:all, :order => :start)

SELECT * FROM "lanparties" WHERE ("lanparties"."id" = 1)
---
  def show
    @lanparty = Lanparty.find(params[:id])

SELECT * FROM "lanparties" WHERE ("lanparties"."id" = 2)
---
  def edit
    @lanparty = Lanparty.find(params[:id])

INSERT INTO "lanparties" ("created_at", "latitude", "title", "added_by", "updated_at", "seats", "end", "start", "website", "description", "longitude") VALUES('2009-06-22 09:04:15', '', 'Leklan Halloween lan', NULL, '2009-06-22 09:04:15', 120, '2009-11-01 12:00:00', '2009-10-30 19:00:00', 'http://www.leklan.nu/', 'Hej på er då var det dags för ännu ett lan. Denna gången är vi i aulan i nossebro skola. Vi kommer att ha några tävlingar. Alla är det inte prispengar i. Turnering Cs 2 Vs 2 om intresse finns kör vi även 5 vs 5. Bagheera / Leklan ni kan skicka ett pm när ni loggat in er på leklan.nu om ni undrar något.', '')
---
  def create
    @lanparty = Lanparty.new(params[:lanparty])

    respond_to do |format|
      if @lanparty.save

SELECT * FROM "lanparties" WHERE ("lanparties"."id" = 1)
UPDATE "lanparties" SET "end" = '2009-11-01 13:00:00', "updated_at" = '2009-06-22 09:05:17', "start" = '2009-10-30 18:00:00' WHERE "id" = 5
---
  def update
    @lanparty = Lanparty.find(params[:id])

    respond_to do |format|
      if @lanparty.update_attributes(params[:lanparty])

SELECT * FROM "lanparties"
---
  def map
    @lanparties = Lanparty.all