app/controllers/participants_controller.rb

SELECT * FROM "participants"
---
  def index
    @participants = Participant.all

SELECT * FROM "participants" WHERE ("participants"."id" = 1)
---
  def show
    @participant = Participant.find(params[:id])

INSERT INTO "participants" ("created_at", "updated_at", "person_id", "lanparty_id") VALUES('2009-06-12 22:13:00', '2009-06-12 22:13:00', 1, 1)
---
  def create
    @participant = Participant.new(params[:participant])

    respond_to do |format|
      if @participant.save